-- ^
-- not    - (unary)
-- *      /       %
-- +      -
-- ..
-- <      >      <=     >=     ~=     ==
-- and
-- or

-- a+i < b/2+1          <-->       (a+i) < ((b/2)+1)
-- 5+x^2*8              <-->       5+((x^2)*8)
-- a < y and y <= z     <-->       (a < y) and (y <= z)
-- -x^2                 <-->       -(x^2)
-- x^y^z                <-->       x^(y^z)

a = 20
b = 10
c = 15
d = 5

e = (a + b) * c / d; -- (30*15)/5
print("(a + b) * c / d 运算值为:",e)

e = ((a + b) * c) / d; -- (30*15)/5
print("((a + b) * c) /d 运算值为:",e)

e = (a + b) * (c / d); -- (30) * (15/5)
print("(a + b) * (a / d) 运算值为:",e)

e = a + (b * c) / d; -- 20 + (150 / 5)
print("a + (b + c)/d运算值为:",e)